; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c3-s3-p25-a1)
(:domain logistics-strips)
(:objects a0 
          c0 c1 c2 
          t0 t1 t2 
          l0-0 l0-1 l0-2 l1-0 l1-1 l1-2 l2-0 l2-1 l2-2 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p20 p21 p22 p23 p24 
)
(:init
    (AIRPLANE a0)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (OBJ p14)
    (OBJ p15)
    (OBJ p16)
    (OBJ p17)
    (OBJ p18)
    (OBJ p19)
    (OBJ p20)
    (OBJ p21)
    (OBJ p22)
    (OBJ p23)
    (OBJ p24)
    (at t0 l0-1)
    (at t1 l1-1)
    (at t2 l2-0)
    (at p0 l1-2)
    (at p1 l1-1)
    (at p2 l0-0)
    (at p3 l1-2)
    (at p4 l1-2)
    (at p5 l1-2)
    (at p6 l1-0)
    (at p7 l0-1)
    (at p8 l1-2)
    (at p9 l2-0)
    (at p10 l0-2)
    (at p11 l2-2)
    (at p12 l1-1)
    (at p13 l1-2)
    (at p14 l0-0)
    (at p15 l0-2)
    (at p16 l0-1)
    (at p17 l1-1)
    (at p18 l1-0)
    (at p19 l0-0)
    (at p20 l2-2)
    (at p21 l1-2)
    (at p22 l2-2)
    (at p23 l0-2)
    (at p24 l1-1)
    (at a0 l1-0)
)
(:goal
    (and
        (at p0 l2-2)
        (at p1 l0-2)
        (at p2 l2-1)
        (at p3 l1-0)
        (at p4 l0-2)
        (at p5 l0-2)
        (at p6 l2-1)
        (at p7 l0-1)
        (at p8 l2-0)
        (at p9 l0-0)
        (at p10 l0-2)
        (at p11 l0-2)
        (at p12 l2-0)
        (at p13 l2-1)
        (at p14 l0-0)
        (at p15 l2-2)
        (at p16 l0-0)
        (at p17 l2-2)
        (at p18 l1-0)
        (at p19 l0-2)
        (at p20 l0-1)
        (at p21 l1-1)
        (at p22 l0-0)
        (at p23 l2-0)
        (at p24 l1-2)
    )
)
)

; plan
1. (drive-truck t2 l2-0 l2-1 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 4 of 25
2. (drive-truck t1 l1-1 l1-2 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-2)
   goals met: 4 of 25
3. (load-truck p8 t1 l1-2)
   deleted: (at p8 l1-2)
   added: (in p8 t1)
   goals met: 4 of 25
4. (load-truck p5 t1 l1-2)
   deleted: (at p5 l1-2)
   added: (in p5 t1)
   goals met: 4 of 25
5. (load-truck p4 t1 l1-2)
   deleted: (at p4 l1-2)
   added: (in p4 t1)
   goals met: 4 of 25
6. (load-truck p3 t1 l1-2)
   deleted: (at p3 l1-2)
   added: (in p3 t1)
   goals met: 4 of 25
7. (load-truck p21 t1 l1-2)
   deleted: (at p21 l1-2)
   added: (in p21 t1)
   goals met: 4 of 25
8. (load-truck p13 t1 l1-2)
   deleted: (at p13 l1-2)
   added: (in p13 t1)
   goals met: 4 of 25
9. (load-truck p0 t1 l1-2)
   deleted: (at p0 l1-2)
   added: (in p0 t1)
   goals met: 4 of 25
10. (load-truck p16 t0 l0-1)
   deleted: (at p16 l0-1)
   added: (in p16 t0)
   goals met: 4 of 25
11. (load-airplane p6 a0 l1-0)
   deleted: (at p6 l1-0)
   added: (in p6 a0)
   goals met: 4 of 25
12. (drive-truck t2 l2-1 l2-2 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-2)
   goals met: 4 of 25
13. (load-truck p22 t2 l2-2)
   deleted: (at p22 l2-2)
   added: (in p22 t2)
   goals met: 4 of 25
14. (load-truck p20 t2 l2-2)
   deleted: (at p20 l2-2)
   added: (in p20 t2)
   goals met: 4 of 25
15. (load-truck p11 t2 l2-2)
   deleted: (at p11 l2-2)
   added: (in p11 t2)
   goals met: 4 of 25
16. (drive-truck t2 l2-2 l2-0 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-0)
   goals met: 4 of 25
17. (unload-truck p22 t2 l2-0)
   deleted: (in p22 t2)
   added: (at p22 l2-0)
   goals met: 4 of 25
18. (unload-truck p20 t2 l2-0)
   deleted: (in p20 t2)
   added: (at p20 l2-0)
   goals met: 4 of 25
19. (unload-truck p11 t2 l2-0)
   deleted: (in p11 t2)
   added: (at p11 l2-0)
   goals met: 4 of 25
20. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 4 of 25
21. (unload-truck p8 t1 l1-0)
   deleted: (in p8 t1)
   added: (at p8 l1-0)
   goals met: 4 of 25
22. (unload-truck p5 t1 l1-0)
   deleted: (in p5 t1)
   added: (at p5 l1-0)
   goals met: 4 of 25
23. (unload-truck p4 t1 l1-0)
   deleted: (in p4 t1)
   added: (at p4 l1-0)
   goals met: 4 of 25
24. (unload-truck p3 t1 l1-0)
   deleted: (in p3 t1)
   added: (at p3 l1-0)
   goals met: 5 of 25
25. (unload-truck p13 t1 l1-0)
   deleted: (in p13 t1)
   added: (at p13 l1-0)
   goals met: 5 of 25
26. (unload-truck p0 t1 l1-0)
   deleted: (in p0 t1)
   added: (at p0 l1-0)
   goals met: 5 of 25
27. (load-airplane p8 a0 l1-0)
   deleted: (at p8 l1-0)
   added: (in p8 a0)
   goals met: 5 of 25
28. (load-airplane p5 a0 l1-0)
   deleted: (at p5 l1-0)
   added: (in p5 a0)
   goals met: 5 of 25
29. (load-airplane p4 a0 l1-0)
   deleted: (at p4 l1-0)
   added: (in p4 a0)
   goals met: 5 of 25
30. (load-airplane p13 a0 l1-0)
   deleted: (at p13 l1-0)
   added: (in p13 a0)
   goals met: 5 of 25
31. (load-airplane p0 a0 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 a0)
   goals met: 5 of 25
32. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 5 of 25
33. (load-truck p24 t1 l1-1)
   deleted: (at p24 l1-1)
   added: (in p24 t1)
   goals met: 5 of 25
34. (unload-truck p21 t1 l1-1)
   deleted: (in p21 t1)
   added: (at p21 l1-1)
   goals met: 6 of 25
35. (load-truck p17 t1 l1-1)
   deleted: (at p17 l1-1)
   added: (in p17 t1)
   goals met: 6 of 25
36. (load-truck p12 t1 l1-1)
   deleted: (at p12 l1-1)
   added: (in p12 t1)
   goals met: 6 of 25
37. (load-truck p1 t1 l1-1)
   deleted: (at p1 l1-1)
   added: (in p1 t1)
   goals met: 6 of 25
38. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 6 of 25
39. (unload-truck p17 t1 l1-0)
   deleted: (in p17 t1)
   added: (at p17 l1-0)
   goals met: 6 of 25
40. (unload-truck p12 t1 l1-0)
   deleted: (in p12 t1)
   added: (at p12 l1-0)
   goals met: 6 of 25
41. (unload-truck p1 t1 l1-0)
   deleted: (in p1 t1)
   added: (at p1 l1-0)
   goals met: 6 of 25
42. (drive-truck t1 l1-0 l1-2 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-2)
   goals met: 6 of 25
43. (unload-truck p24 t1 l1-2)
   deleted: (in p24 t1)
   added: (at p24 l1-2)
   goals met: 7 of 25
44. (load-airplane p17 a0 l1-0)
   deleted: (at p17 l1-0)
   added: (in p17 a0)
   goals met: 7 of 25
45. (load-airplane p12 a0 l1-0)
   deleted: (at p12 l1-0)
   added: (in p12 a0)
   goals met: 7 of 25
46. (load-airplane p1 a0 l1-0)
   deleted: (at p1 l1-0)
   added: (in p1 a0)
   goals met: 7 of 25
47. (fly-airplane a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 7 of 25
48. (unload-airplane p5 a0 l0-0)
   deleted: (in p5 a0)
   added: (at p5 l0-0)
   goals met: 7 of 25
49. (fly-airplane a0 l0-0 l2-0)
   deleted: (at a0 l0-0)
   added: (at a0 l2-0)
   goals met: 7 of 25
50. (load-airplane p9 a0 l2-0)
   deleted: (at p9 l2-0)
   added: (in p9 a0)
   goals met: 7 of 25
51. (unload-airplane p8 a0 l2-0)
   deleted: (in p8 a0)
   added: (at p8 l2-0)
   goals met: 8 of 25
52. (unload-airplane p6 a0 l2-0)
   deleted: (in p6 a0)
   added: (at p6 l2-0)
   goals met: 8 of 25
53. (load-truck p6 t2 l2-0)
   deleted: (at p6 l2-0)
   added: (in p6 t2)
   goals met: 8 of 25
54. (load-airplane p22 a0 l2-0)
   deleted: (at p22 l2-0)
   added: (in p22 a0)
   goals met: 8 of 25
55. (load-airplane p20 a0 l2-0)
   deleted: (at p20 l2-0)
   added: (in p20 a0)
   goals met: 8 of 25
56. (unload-airplane p17 a0 l2-0)
   deleted: (in p17 a0)
   added: (at p17 l2-0)
   goals met: 8 of 25
57. (load-truck p17 t2 l2-0)
   deleted: (at p17 l2-0)
   added: (in p17 t2)
   goals met: 8 of 25
58. (unload-airplane p13 a0 l2-0)
   deleted: (in p13 a0)
   added: (at p13 l2-0)
   goals met: 8 of 25
59. (load-truck p13 t2 l2-0)
   deleted: (at p13 l2-0)
   added: (in p13 t2)
   goals met: 8 of 25
60. (unload-airplane p12 a0 l2-0)
   deleted: (in p12 a0)
   added: (at p12 l2-0)
   goals met: 9 of 25
61. (load-airplane p11 a0 l2-0)
   deleted: (at p11 l2-0)
   added: (in p11 a0)
   goals met: 9 of 25
62. (unload-airplane p0 a0 l2-0)
   deleted: (in p0 a0)
   added: (at p0 l2-0)
   goals met: 9 of 25
63. (load-truck p0 t2 l2-0)
   deleted: (at p0 l2-0)
   added: (in p0 t2)
   goals met: 9 of 25
64. (drive-truck t2 l2-0 l2-1 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 9 of 25
65. (unload-truck p6 t2 l2-1)
   deleted: (in p6 t2)
   added: (at p6 l2-1)
   goals met: 10 of 25
66. (unload-truck p13 t2 l2-1)
   deleted: (in p13 t2)
   added: (at p13 l2-1)
   goals met: 11 of 25
67. (drive-truck t2 l2-1 l2-2 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-2)
   goals met: 11 of 25
68. (unload-truck p17 t2 l2-2)
   deleted: (in p17 t2)
   added: (at p17 l2-2)
   goals met: 12 of 25
69. (unload-truck p0 t2 l2-2)
   deleted: (in p0 t2)
   added: (at p0 l2-2)
   goals met: 13 of 25
70. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 13 of 25
71. (load-truck p5 t0 l0-0)
   deleted: (at p5 l0-0)
   added: (in p5 t0)
   goals met: 13 of 25
72. (load-truck p19 t0 l0-0)
   deleted: (at p19 l0-0)
   added: (in p19 t0)
   goals met: 13 of 25
73. (unload-truck p16 t0 l0-0)
   deleted: (in p16 t0)
   added: (at p16 l0-0)
   goals met: 14 of 25
74. (drive-truck t0 l0-0 l0-2 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-2)
   goals met: 14 of 25
75. (unload-truck p5 t0 l0-2)
   deleted: (in p5 t0)
   added: (at p5 l0-2)
   goals met: 15 of 25
76. (load-truck p23 t0 l0-2)
   deleted: (at p23 l0-2)
   added: (in p23 t0)
   goals met: 15 of 25
77. (unload-truck p19 t0 l0-2)
   deleted: (in p19 t0)
   added: (at p19 l0-2)
   goals met: 16 of 25
78. (load-truck p15 t0 l0-2)
   deleted: (at p15 l0-2)
   added: (in p15 t0)
   goals met: 16 of 25
79. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 16 of 25
80. (unload-truck p23 t0 l0-0)
   deleted: (in p23 t0)
   added: (at p23 l0-0)
   goals met: 16 of 25
81. (unload-truck p15 t0 l0-0)
   deleted: (in p15 t0)
   added: (at p15 l0-0)
   goals met: 16 of 25
82. (fly-airplane a0 l2-0 l0-0)
   deleted: (at a0 l2-0)
   added: (at a0 l0-0)
   goals met: 16 of 25
83. (unload-airplane p9 a0 l0-0)
   deleted: (in p9 a0)
   added: (at p9 l0-0)
   goals met: 17 of 25
84. (unload-airplane p4 a0 l0-0)
   deleted: (in p4 a0)
   added: (at p4 l0-0)
   goals met: 17 of 25
85. (load-truck p4 t0 l0-0)
   deleted: (at p4 l0-0)
   added: (in p4 t0)
   goals met: 17 of 25
86. (load-airplane p23 a0 l0-0)
   deleted: (at p23 l0-0)
   added: (in p23 a0)
   goals met: 17 of 25
87. (unload-airplane p22 a0 l0-0)
   deleted: (in p22 a0)
   added: (at p22 l0-0)
   goals met: 18 of 25
88. (unload-airplane p20 a0 l0-0)
   deleted: (in p20 a0)
   added: (at p20 l0-0)
   goals met: 18 of 25
89. (load-truck p20 t0 l0-0)
   deleted: (at p20 l0-0)
   added: (in p20 t0)
   goals met: 18 of 25
90. (load-airplane p2 a0 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 a0)
   goals met: 18 of 25
91. (load-airplane p15 a0 l0-0)
   deleted: (at p15 l0-0)
   added: (in p15 a0)
   goals met: 18 of 25
92. (unload-airplane p11 a0 l0-0)
   deleted: (in p11 a0)
   added: (at p11 l0-0)
   goals met: 18 of 25
93. (load-truck p11 t0 l0-0)
   deleted: (at p11 l0-0)
   added: (in p11 t0)
   goals met: 18 of 25
94. (unload-airplane p1 a0 l0-0)
   deleted: (in p1 a0)
   added: (at p1 l0-0)
   goals met: 18 of 25
95. (load-truck p1 t0 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 t0)
   goals met: 18 of 25
96. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 18 of 25
97. (unload-truck p20 t0 l0-1)
   deleted: (in p20 t0)
   added: (at p20 l0-1)
   goals met: 19 of 25
98. (drive-truck t0 l0-1 l0-2 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-2)
   goals met: 19 of 25
99. (unload-truck p4 t0 l0-2)
   deleted: (in p4 t0)
   added: (at p4 l0-2)
   goals met: 20 of 25
100. (unload-truck p11 t0 l0-2)
   deleted: (in p11 t0)
   added: (at p11 l0-2)
   goals met: 21 of 25
101. (unload-truck p1 t0 l0-2)
   deleted: (in p1 t0)
   added: (at p1 l0-2)
   goals met: 22 of 25
102. (fly-airplane a0 l0-0 l2-0)
   deleted: (at a0 l0-0)
   added: (at a0 l2-0)
   goals met: 22 of 25
103. (unload-airplane p23 a0 l2-0)
   deleted: (in p23 a0)
   added: (at p23 l2-0)
   goals met: 23 of 25
104. (unload-airplane p2 a0 l2-0)
   deleted: (in p2 a0)
   added: (at p2 l2-0)
   goals met: 23 of 25
105. (unload-airplane p15 a0 l2-0)
   deleted: (in p15 a0)
   added: (at p15 l2-0)
   goals met: 23 of 25
106. (drive-truck t2 l2-2 l2-0 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-0)
   goals met: 23 of 25
107. (load-truck p2 t2 l2-0)
   deleted: (at p2 l2-0)
   added: (in p2 t2)
   goals met: 23 of 25
108. (load-truck p15 t2 l2-0)
   deleted: (at p15 l2-0)
   added: (in p15 t2)
   goals met: 23 of 25
109. (drive-truck t2 l2-0 l2-1 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 23 of 25
110. (unload-truck p2 t2 l2-1)
   deleted: (in p2 t2)
   added: (at p2 l2-1)
   goals met: 24 of 25
111. (drive-truck t2 l2-1 l2-2 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-2)
   goals met: 24 of 25
112. (unload-truck p15 t2 l2-2)
   deleted: (in p15 t2)
   added: (at p15 l2-2)
   goals met: 25 of 25
